meeting/minutes/2022/11-01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 009 Minutes 2022-11-01</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 009 Minutes 2022-11-01</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/9]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[9/13]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#next-meeting">1.3. Next meeting</a></li>
<li><a href="#approve-minutes">1.4. Approve minutes of the previous meeting</a></li>
<li><a href="#review-of-actions">1.5. Review of open action items <code>[4/6]</code></a></li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical Agenda</a>
<ul>
<li><a href="#pr-variadic-functions">2.1. Review pull request #197 (was 166; variadic functions)</a></li>
<li><a href="#pr-subtyping">2.2. Review pull request #202 (was 196; subtyping)</a></li>
<li><a href="#pr-fn-while">2.3. Review pull request #210: Issue 80: fn:while</a></li>
<li><a href="#pr-parse-uri">2.4. Review pull request #215: parse-uri and build-uri functions</a></li>
<li><a href="#pr-sequence-comparison">2.5. Review pull request #222: Sequence comparision</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="./11-08.html">at meeting 010</a> on 8 November 2022.
</p>
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/9]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-007-05: NW to make an issue for Martin’s proposed ammendment to map:build</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-01: NW to coordinate with MK on an agenda for next week.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-02: NW to work with MK to make sure PR #197 is updated correctly</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-03: NW to investigate the relationship between PR #215 and <code>resolve-uri</code>.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-04: NW to review RFC 3896 wrt relative URIs</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-05: NW to fix the return type for <code>parse-uri</code>; consider using a record type.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-06: NW to add error tests for <code>parse-uri</code>.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-06: NW to make the query segments an array of maps.</li>
</ul>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[9/13]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: BTW
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Anthony (Tony) Bufort (AB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Ed Porter (EP)</li>
<li class="off"><code>[&#xa0;]</code> Liam Quin (LQ)</li>
<li class="off"><code>[&#xa0;]</code> Adam Retter</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (MSM)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW). <i>Chair</i>. <i>Scribe</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2022/11-01.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.3.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting <a href="../../agenda/2022/11-08.html">is scheduled for Tuesday, 8 November</a>. This conflicts
with Declarative Amsterdam.
</p>

<p>
Shall we meet?
</p>

<p>
After some discussion, yes, next week will be chaired by MSM and will
focus on XSLT issues.
</p>

<p>
ACTION: QT4CG-009-01: NW to coordinate with MK on an agenda for next week.
</p>

<p>
Regrets for 8 November: NW, JL, CG.
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.4.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2022/10-25.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-review-of-actions" class="outline-3">
<h3 id="review-of-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[4/6]</code></h3>
<div class="outline-text-3" id="text-review-of-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="on"><code>[X]</code> QT4CG-005-03: RD to review the variadic functions proposal in #197 (formerly #166)</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-007-05: NW to make an issue for Martin’s proposed ammendment to map:build</li>
<li class="on"><code>[X]</code> QT4CG-008-01: MK to review RD’s comments on PR #202</li>
<li class="on"><code>[X]</code> QT4CG-008-02: NW to review MKs comments on PR #215
<ul class="org-ul">
<li>Updates to PR <a href="https://qt4cg.org/dashboard/#pr-215">#215</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-008-03: MK to make a PR for issue #96, starts|ends-with-sequence
<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-222">#222</a></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-variadic-functions" class="outline-3">
<h3 id="pr-variadic-functions"><span class="section-number-3">2.1.</span> Review pull request #197 (was 166; variadic functions)</h3>
<div class="outline-text-3" id="text-pr-variadic-functions">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-197">pull request #197</a> (you’ll find links to formatted versions of the specs at <a href="https://qt4cg.org/">https://qt4cg.org/</a>).
</p>

<p>
See also the nexus of issues <a href="https://github.com/qt4cg/qtspecs/issues/162">#162</a>, <a href="https://github.com/qt4cg/qtspecs/issues/161">#161</a>, <a href="https://github.com/qt4cg/qtspecs/issues/160">#160</a>, <a href="https://github.com/qt4cg/qtspecs/issues/159">#159</a>, <a href="https://github.com/qt4cg/qtspecs/issues/158">#158</a>, <a href="https://github.com/qt4cg/qtspecs/issues/157">#157</a>, and <a href="https://github.com/qt4cg/qtspecs/issues/155">#155</a>.
</p>

<p>
See the discussion from <a href="../../minutes/2022/10-11.html#pr-variadic-functions">three weeks ago</a>, <a href="../../minutes/2022/10-18.html#pr-variadic-functions">two weeks ago</a>, and <a href="../../minutes/2022/10-25.html#pr-variadic-functions">last week</a>.
</p>

<p>
We hope to resolve this PR this week.
</p>

<ul class="org-ul">
<li>MK: I believe I responded to all the comments. None were
particularly problematic. Just minor mistakes. One technical issue
that is now an error condition.</li>
<li>RD: I made a few comments about an hour ago.
<ul class="org-ul">
<li>RD walks us through <a href="https://github.com/qt4cg/qtspecs/pull/197#pullrequestreview-1163389605">his comments</a> on the pull request</li>
</ul></li>
</ul>

<p>
It appears that MK’s most recent commits haven’t been reflected in the diffs.
</p>

<p>
ACTION: QT4CG-009-02: NW to work with MK to make sure PR #197 is updated correctly
</p>

<p>
We’ll revisit this in two weeks.
</p>
</div>
</div>

<div id="outline-container-pr-subtyping" class="outline-3">
<h3 id="pr-subtyping"><span class="section-number-3">2.2.</span> Review pull request #202 (was 196; subtyping)</h3>
<div class="outline-text-3" id="text-pr-subtyping">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-202">pull request #202</a>
</p>

<ul class="org-ul">
<li>MK: No progress, I haven’t responded to the latest comments.</li>
</ul>
</div>
</div>

<div id="outline-container-pr-fn-while" class="outline-3">
<h3 id="pr-fn-while"><span class="section-number-3">2.3.</span> Review pull request #210: Issue 80: fn:while</h3>
<div class="outline-text-3" id="text-pr-fn-while">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-210">pull request #210</a>
</p>

<ul class="org-ul">
<li>CG: The latest issue was how to name the function. If the function
is named <code>fn:while</code> then we can’t introduce a <code>while</code> keyword later
because it will create a conflict. MK proposed <code>fn:iterate</code>. We could also
use <code>fn:until</code> with the semantics reversed.</li>
<li>NW: I like the similarity of <code>fn:iterate</code> with XSLT.</li>
<li>MSM: Is that a conflict with XSLT?</li>
<li>NW: No, because it’s an instruction in XSLT, not a function.</li>
<li>MK: The semantics have enough of an analogy that it seems reasonable.</li>
<li>JK: Is there a way to setup the keyword <code>while</code> so that there’s some
sytax after it that prevents any confusion?</li>
</ul>

<p>
Some discussion of whether or not we could distingish the keyword from the function.
</p>

<ul class="org-ul">
<li>MSM: Depending on exactly what people have in mind for a <code>while</code>
keyword, my gut feeling is that I expect a <code>while</code> to be followed by
a boolean expression. So we can’t solve the lookahead problem that
way.</li>
<li>RD: The only problem using <code>while</code> which would confuse it with a keyword
would be in the case where <code>while</code> would have a parenthesis
following it because that applies to keywords like <code>typeswitch</code>,
<code>if</code>, and others. Given that the <code>while</code> expression is following the
FLOWR syntax, I don’t see it raising a clash in the grammar.</li>
<li>MK: There would be a conflict if you allowed it as the first thing
in an expression and allowed it to be followed by an expresison.</li>
<li>CG: Do we think in the future we may get rid of the <code>for</code> and <code>let</code>
as the beginning of the FLOWR clause?</li>
<li>MK: I think this is a question of trying to avoid restricting our
options downstream.</li>
<li>MSM: CG, was your alternative name <code>until</code> or <code>repeat</code>?</li>
<li>CG: It was <code>until</code> but it could be <code>repeat</code>.</li>
<li>MK: I quite like <code>repeat</code>.</li>
<li>MSM: For those of us with Pascal backgrounds, <code>repeat</code> differs from
<code>while</code> in that the loop is bound to occur once.</li>
<li>CG: If you inverted the condition, it would always execute at least
once. I like <code>while</code> because it’s more popular and you don’t have to
have a negated condition.</li>
<li>DN: Comparing <code>while</code> and <code>until</code>, I don’t think they’re the same at all.</li>
<li>MSM: I think I could live with any (almost any?) of the proposed
names, but in the end if we don't want to use <code>while</code>, I think I
lean towards <code>iterate</code> for the parallel to <code>xsl:iterate</code></li>
<li>DN: There is also a proposal for a <code>while</code> keyword. What’s the difference?</li>
<li>CG: I think the main difference is that if you have a FLOWR
epxression you’re operating on a sequence . With the <code>while</code> function you
can have arbitrary inputs that are transformed by the body.</li>
<li>MK: In that respect, it is quite different from <code>xsl:iterate</code> as
that does operate over a sequence.</li>
<li>NW: Mmm, true.</li>
<li>MSM: That pushes me back to <code>repeat</code> or <code>until</code> if we can’t use
<code>while</code>. That difference that CG has just identifeid is significant.</li>
</ul>

<p>
Leave it for a week?
</p>

<ul class="org-ul">
<li>MK: One approach is to adopt a name that we don’t like and then
after you’ve used it for a while, and you can revisit the name
later.</li>
<li>RD: Would it make sense to keep <code>while</code> for now in that case?</li>
<li>DN: Can someone write some comments on the issue? I feel very
confused right now.</li>
</ul>

<p>
Let’s come back to this in two weeks.
</p>

<p>
Let’s all try to follow up in the issue so that in two weeks we’re
ready to pick a name, or pick a name we don’t exactly like to live
with for a while. In either case, pick a name!
</p>
</div>
</div>

<div id="outline-container-pr-parse-uri" class="outline-3">
<h3 id="pr-parse-uri"><span class="section-number-3">2.4.</span> Review pull request #215: parse-uri and build-uri functions</h3>
<div class="outline-text-3" id="text-pr-parse-uri">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-215">pull request #215</a>
</p>

<p>
NW walks through the current prose for  <code>parse-uri</code>.
</p>

<ul class="org-ul">
<li>JL: Does reconstructing give back the original or an equivalent?</li>
<li>NW: That’s a little hard to answer before I redraft the build function.</li>
<li>MK: How well does this play with <code>resolve-uri</code>?</li>
</ul>

<p>
Some discussion. MK observes that if <code>resolve-uri</code> has stricter
semantics, you could end up deciding you had a relative path but then
it would be rejected by <code>resolve-uri</code>. That’s a mess.
</p>

<p>
ACTION: QT4CG-009-03: NW to investigate the relationship between PR #215 and <code>resolve-uri</code>.
</p>

<ul class="org-ul">
<li>MSM: Two questions and a comment. you said in introducing the
function you had started by thinking we could parse against RFC 3986
and shifted to something else to deal with relative URIs. But RFC 3986
has two roots, wouldn’t that be sufficient.</li>
</ul>

<p>
ACTION: QT4CG-009-04: NW to review RFC 3896 wrt relative URIs
</p>

<p>
MSM highlights the rule about matching a drive letter that NW had
missed in his description.
</p>

<ul class="org-ul">
<li>MSM: This rule and the backslash rule will be lossy. So to JL’s
question, you’ll get a functionally equivalent URI.</li>
<li>RD: Three points. First, the return type is map where the value is
string, but some of the components return an array of strings.
Second, wouldn’t this be better specified as a record type? Third,
Do we want to reference what the WHAT WG URL document?</li>
</ul>

<p>
ACTION: QT4CG-009-05: NW to fix the return type for <code>parse-uri</code>; consider using a record type.
</p>

<ul class="org-ul">
<li>DN: This question is more of a wish: I’d prefer if the test cases
included tests for the error conditions.</li>
<li>NW: Yes, of course, that’s an oversight.</li>
</ul>

<p>
ACTION: QT4CG-009-06: NW to add error tests for <code>parse-uri</code>.
</p>

<ul class="org-ul">
<li>CG: Instead of returning an array of strings, what about returning a map of the query segments?</li>
<li>NW: That’s tricky because the keys aren’t necessarily unique, it would have to be an array of maps.</li>
<li>MK: We’re considering improvements to the lookup operator that would work on an array of maps.</li>
<li>NW: Right then, that’s enough to make me think that’s better.</li>
</ul>

<p>
ACTION: QT4CG-009-06: NW to make the query segments an array of maps.
</p>
</div>
</div>

<div id="outline-container-pr-sequence-comparison" class="outline-3">
<h3 id="pr-sequence-comparison"><span class="section-number-3">2.5.</span> Review pull request #222: Sequence comparision</h3>
<div class="outline-text-3" id="text-pr-sequence-comparison">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-222">pull request #222</a> and issues <a href="https://github.com/qt4cg/qtspecs/issues/94">#94</a> and <a href="https://github.com/qt4cg/qtspecs/issues/96">#96</a>.
</p>

<ul class="org-ul">
<li>MK: I’ve propopsed three new functions. The main thing I discovered
is that these are far more poweful than I realized in that the
matching doesn’t have to be an equality match. You can look for a
sequence of paragraphs by matching on the name of the child element,
for example.</li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
</div>
</body>
</html>
